# Install cask apps to /Applications
cask_args appdir: "/Applications"

# install packages
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"

brew "cmake"
brew "exa"
brew "fd"
brew "fork-cleaner"
brew "git-imerge"
brew "git-when-merged"
brew "git"
brew "glide"
brew "go"
brew "grc"
brew "heroku"
brew "hub"
brew "imagemagick"
brew "jq"
brew "jsonlint"
# So that we can install Mac App Store apps (some of which are below)
brew "mas"
brew "mercurial"
brew "neovim"
brew "openssl"
brew "python"
brew "rbenv"
brew "readline"
brew "rmtrash"
brew "rsync"
brew "ruby-build"
brew "sqlite"
brew "tree"
brew "wget"
brew "xz"
brew "yarn"
brew "zsh"
brew "zsh-autosuggestions"


# Casks
cask "1password"
cask "alfred"
cask "amazon-music"
cask "android-studio"
cask "beyond-compare"
cask "cloudapp"
cask "daisydisk"
# Docker for Mac
cask "docker"
cask "dropbox"
cask "fastscripts"
cask "firefox"
cask "google-chrome"
cask "google-photos-backup-and-sync"
cask "iterm2"
cask "java8"
cask "kindle"
cask "licecap"
cask "muzzle"
cask "ngrok"
cask "pgadmin4"
cask "qbserve"
cask "quitter"
cask "selfcontrol"
cask "skype"
cask "slack"
cask "steam"
cask "textexpander"
cask "the-unarchiver"
cask "tower"
cask "transmission"
cask "ubiquiti-unifi-controller"
cask "vagrant"
cask "virtualbox"
cask "viscosity"
cask "visual-studio-code"
cask "vmware-fusion"
cask "zoomus"

# Mac App Store
mas "Clocks", id: 414554506
mas "Dash", id: 458034879
mas "iMovie", id: 408981434
mas "iPhoto", id: 408981381
mas "Keynote", id: 409183694
mas "Marked", id: 448925439
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Remote Desktop", id: 715768417
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PhotoSweeper", id: 463362050
mas "Silent Sifter", id: 540196459
mas "Xcode", id: 497799835
